БухЭксп/Catalogs/CW_МакросыШаблоновДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_МакросыШаблоновДокументов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеШаблона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредопределеннаяФункция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПредопреленныеФункцииШаблоновДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКДанным</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рассчитывается</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВывода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬЗначениеКонтрольнойДаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬРеквизитОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬМониторинговыйПараметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬМониторинговыйПараметрРеквизит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬФорматВыводаРеквизитаОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_МакросыШаблоновДокументов/Ext/ManagerModule.bsl
//Функция ПолучитьЗначениеПараметраПредопределенногоПараметра(ПараметрШаблона, ОбъектПечати) Экспорт
// Параметры процедуры
//  - ПараметрШаблона 	- ссылка на предпоереленный элемент справочника "CW_МакросыШаблоновДокументов";
//  - ОбъектПечати 		- Ссылка на элемент, для которого печатается документ, типы см. ОпределяемыеТипы "CW_НазначенияШаблоновДокументов"  
//
Функция ПолучитьЗначениеПараметраПредопределенногоПараметра(ИмяПараметра, ОбъектПечати) Экспорт
	
	СведенияОбОрганизации = Неопределено;
    СведенияОКонтрагенте = Неопределено;
	
	ПолучитьСведенияОбОрганизацииКонтрагенте(ОбъектПечати, СведенияОбОрганизации, СведенияОКонтрагенте);
	
	
	
	
	
		
	//Возврат ПолучитьЗначениеОтсутствует();
	
КонецФункции

Функция ПолучитьЗначениеПараметраОбъекта(ОбъектПечати, МакросШаблона) Экспорт
	
	ЗначениеПустойСсылки = МакросШаблона.НазначениеШаблона.ЗначениеПустойСсылки;
	
	Схема = CW_ШаблоныДокументовСерверВызовСервера.ПолучитьСхемуКомпоновкиДанных(ТипЗнч(ЗначениеПустойСсылки));
	
	НаборДанных = Схема.НаборыДанных.Получить(0);
	НаборДанных.Запрос = СтрЗаменить(НаборДанных.Запрос, "ВЫБРАТЬ", "ВЫБРАТЬ ПЕРВЫЕ 1"); 
	
	АдресСхемы 	= ПоместитьВоВременноеХранилище(Схема, Новый УникальныйИдентификатор);
	
	ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы);
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(ИсточникДоступныхНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	
	ПолеВыбор = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных")); 
	ПолеВыбор.Поле 			= Новый ПолеКомпоновкиДанных(МакросШаблона.ПутьКДанным); 
	ПолеВыбор.Использование = Истина;  
	
	ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения  	= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение	= ОбъектПечати;
	ЭлементОтбора.Использование 	= Истина;  
	
	КомпоновщикМакета 	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки 	= КомпоновщикМакета.Выполнить(Схема, КомпоновщикНастроек.Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных 	= Новый ПроцессорКомпоновкиДанных;    
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	ПроцессорВыводаРезультата 	= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;    
	ПроцессорВыводаРезультата.УстановитьОбъект(ТаблицаЗначений);
	ПроцессорВыводаРезультата.Вывести(ПроцессорКомпоновкиДанных); 
	
	Колонка = ТаблицаЗначений.Колонки[1];
	
	Если ТаблицаЗначений.Количество() = 1 Тогда
		Возврат ТаблицаЗначений[0][Колонка.Имя];
	КонецЕсли;     
	
	Типы = Колонка.ТипЗначения.Типы();
	Если Типы.Найти(Тип("Null")) <> Неопределено Тогда
		Типы.Удалить(Типы.Найти(Тип("Null")));	
	КонецЕсли;
	
	ОписаниеТипов = Новый ОписаниеТипов(Типы);
	
	Возврат ОписаниеТипов.ПривестиЗначение(Неопределено);

КонецФункции  

Функция ЕстьХранилищеЗначения(ИмяРегистра)
	
	Массив = Новый Массив;
	Массив.Добавить("CW_ХарактеристикиГрузоперевозок");
	Массив.Добавить("CW_ХарактеристикиЗаказов");
	Массив.Добавить("CW_ХарактеристикиЗаявок");       
	
	Возврат Массив.Найти(ИмяРегистра) <> Неопределено;
	
КонецФункции
	

 Функция ПолучитьСоответствиеИменПоля()
	
	Соответствие = Новый Соответствие;  
	Соответствие.Вставить(Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам"),"Объект");
	Соответствие.Вставить(Тип("СправочникСсылка.CW_ПриложенияКДоговорам"),"Объект");
	Соответствие.Вставить(Тип("СправочникСсылка.CW_Заказы"),"Заказ");
	Соответствие.Вставить(Тип("СправочникСсылка.CW_Заявки"),"Заявка");
	Соответствие.Вставить(Тип("СправочникСсылка.CW_Грузоперевозки"),"Грузоперевозка");
	
	Возврат Соответствие;
	
КонецФункции

Функция ПолучитьСоответствиеИменРегистра()
	
	Соответствие = Новый Соответствие;  
	Соответствие.Вставить(Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам"),"CW_ХарактеристикиДоговоровИПриложений");
	Соответствие.Вставить(Тип("СправочникСсылка.CW_ПриложенияКДоговорам"),"CW_ХарактеристикиДоговоровИПриложений");
	Соответствие.Вставить(Тип("СправочникСсылка.CW_Заказы"),"CW_ХарактеристикиЗаказов");
	Соответствие.Вставить(Тип("СправочникСсылка.CW_Заявки"),"CW_ХарактеристикиЗаявок");
	Соответствие.Вставить(Тип("СправочникСсылка.CW_Грузоперевозки"),"CW_ХарактеристикиГрузоперевозок");
	
	Возврат Соответствие;
	
КонецФункции

Процедура ПолучитьСведенияОбОрганизацииКонтрагенте(Знач ОбъектПечати, СведенияОбОрганизации, СведенияОКонтрагенте)
	
	Если ТипЗнч(ОбъектПечати) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") Тогда
		
		ДатаСреза 	= ОбъектПечати.ДатаДоговора;    
		Организация = ОбъектПечати.Организация;    
		Контрагент 	= ОбъектПечати.Владелец;  
		
	ИначеЕсли ТипЗнч(ОбъектПечати) = Тип("СправочникСсылка.CW_ПриложенияКДоговорам") Тогда 
		
		ДатаСреза 	= ОбъектПечати.ДатаДокумента;
		Организация = ОбъектПечати.Договор.Организация;    
		Контрагент 	= ОбъектПечати.Договор.Владелец;   
		
	Иначе    
		
		Возврат;  
		
	КонецЕсли;
	
	СведенияОбОрганизации = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(Организация, ДатаСреза);   
	СведенияОКонтрагенте  = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(Контрагент,  ДатаСреза); 
	
КонецПроцедуры   

Процедура ВыполнитьКонвертациюМакросов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_МакросыШаблоновДокументов.Ссылка КАК Ссылка,
	|	CW_МакросыШаблоновДокументов.УДАЛИТЬЗначениеКонтрольнойДаты КАК УДАЛИТЬЗначениеКонтрольнойДаты,
	|	CW_МакросыШаблоновДокументов.УДАЛИТЬРеквизитОбъекта КАК УДАЛИТЬРеквизитОбъекта,
	|	CW_МакросыШаблоновДокументов.УДАЛИТЬМониторинговыйПараметр КАК УДАЛИТЬМониторинговыйПараметр,
	|	CW_МакросыШаблоновДокументов.УДАЛИТЬМониторинговыйПараметрРеквизит КАК УДАЛИТЬМониторинговыйПараметрРеквизит,
	|	CW_МакросыШаблоновДокументов.УДАЛИТЬФорматВыводаРеквизитаОбъекта КАК УДАЛИТЬФорматВыводаРеквизитаОбъекта,
	|	CW_МакросыШаблоновДокументов.Рассчитывается КАК Рассчитывается,
	|	CW_МакросыШаблоновДокументов.УДАЛИТЬМониторинговыйПараметр.Идентификатор КАК Идентификатор,
	|	CW_МакросыШаблоновДокументов.УДАЛИТЬМониторинговыйПараметр.ИдентификаторПлан КАК ИдентификаторПлан,
	|	CW_МакросыШаблоновДокументов.УДАЛИТЬМониторинговыйПараметр.ИдентификаторФакт КАК ИдентификаторФакт
	|ИЗ
	|	Справочник.CW_МакросыШаблоновДокументов КАК CW_МакросыШаблоновДокументов
	|ГДЕ
	|	CW_МакросыШаблоновДокументов.ЭтоГруппа = ЛОЖЬ
	|	И (CW_МакросыШаблоновДокументов.Рассчитывается = 3
	|			ИЛИ CW_МакросыШаблоновДокументов.Рассчитывается = 1)";     
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект(); 
		СправочникОбъект.Рассчитывается = 1;
		СправочникОбъект.ФорматВывода	= Выборка.УДАЛИТЬФорматВыводаРеквизитаОбъекта;
		
		Если Не ПустаяСтрока(Выборка.УДАЛИТЬРеквизитОбъекта) Тогда
			//Реквизит
			ИмяРеквизита = Выборка.УДАЛИТЬРеквизитОбъекта;
			Если СтрНачинаетсяС(ИмяРеквизита, ".") Тогда    
				ИмяРеквизита = Сред(ИмяРеквизита, 2);
			КонецЕсли;
			
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Выборка.УДАЛИТЬМониторинговыйПараметр) Тогда  
			
			Идентификатор = Выборка.Идентификатор;	
			Если Выборка.УДАЛИТЬЗначениеКонтрольнойДаты = "Факт" Тогда
				Идентификатор = Выборка.ИдентификаторФакт;	
			ИначеЕсли Выборка.УДАЛИТЬЗначениеКонтрольнойДаты = "План" Тогда 
				Идентификатор = Выборка.ИдентификаторПлан;	
			КонецЕсли;
			
			ИмяРеквизита = "["+Идентификатор+"]"
			
		КонецЕсли;
		
		СправочникОбъект.ПутьКДанным = "Ссылка."+ИмяРеквизита;	
		
		СправочникОбъект.Записать();
		
	КонецЦикла;   
	
КонецПроцедуры
